# VendorId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalService..::..VendorId Property
ExternalService Class See Also
---
The vendor who provided the service
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public string VendorId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property VendorId As String
	Get
```

Visual C++
---
```text
public:
property String^ VendorId {
	String^ get ();
}
```

# See Also
ExternalService Class
Autodesk.Revit.DB.ExternalService Namespace